{
  "</box>": 151674,
  "</image>": 151670,
  "</image_id>": 151682,
  "</point>": 151678,
  "</quad>": 151676,
  "</ref>": 151672,
  "</slice>": 151680,
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "</unit>": 151684,
  "<box>": 151673,
  "<image>": 151669,
  "<image_id>": 151681,
  "<point>": 151677,
  "<quad>": 151675,
  "<ref>": 151671,
  "<slice>": 151679,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<unit>": 151683,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|reserved_0|>": 151685,
  "<|reserved_10|>": 151695,
  "<|reserved_11|>": 151696,
  "<|reserved_12|>": 151697,
  "<|reserved_13|>": 151698,
  "<|reserved_14|>": 151699,
  "<|reserved_15|>": 151700,
  "<|reserved_16|>": 151701,
  "<|reserved_17|>": 151702,
  "<|reserved_18|>": 151703,
  "<|reserved_19|>": 151704,
  "<|reserved_1|>": 151686,
  "<|reserved_20|>": 151705,
  "<|reserved_21|>": 151706,
  "<|reserved_22|>": 151707,
  "<|reserved_23|>": 151708,
  "<|reserved_24|>": 151709,
  "<|reserved_25|>": 151710,
  "<|reserved_26|>": 151711,
  "<|reserved_27|>": 151712,
  "<|reserved_28|>": 151713,
  "<|reserved_29|>": 151714,
  "<|reserved_2|>": 151687,
  "<|reserved_30|>": 151715,
  "<|reserved_31|>": 151716,
  "<|reserved_32|>": 151717,
  "<|reserved_33|>": 151718,
  "<|reserved_34|>": 151719,
  "<|reserved_35|>": 151720,
  "<|reserved_36|>": 151721,
  "<|reserved_37|>": 151722,
  "<|reserved_38|>": 151723,
  "<|reserved_39|>": 151724,
  "<|reserved_3|>": 151688,
  "<|reserved_40|>": 151725,
  "<|reserved_41|>": 151726,
  "<|reserved_42|>": 151727,
  "<|reserved_43|>": 151728,
  "<|reserved_44|>": 151729,
  "<|reserved_45|>": 151730,
  "<|reserved_46|>": 151731,
  "<|reserved_47|>": 151732,
  "<|reserved_48|>": 151733,
  "<|reserved_49|>": 151734,
  "<|reserved_4|>": 151689,
  "<|reserved_50|>": 151735,
  "<|reserved_51|>": 151736,
  "<|reserved_52|>": 151737,
  "<|reserved_53|>": 151738,
  "<|reserved_54|>": 151739,
  "<|reserved_55|>": 151740,
  "<|reserved_56|>": 151741,
  "<|reserved_57|>": 151742,
  "<|reserved_58|>": 151743,
  "<|reserved_59|>": 151744,
  "<|reserved_5|>": 151690,
  "<|reserved_60|>": 151745,
  "<|reserved_61|>": 151746,
  "<|reserved_62|>": 151747,
  "<|reserved_6|>": 151691,
  "<|reserved_7|>": 151692,
  "<|reserved_8|>": 151693,
  "<|reserved_9|>": 151694,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
